episode05/load-test.yaml
config:
  phases:
    - duration: 100
      arrivalRate: 10
  payload:
    path: "small-queries.csv"
    fields:
      - "a"
      - "b"
  http:
    timeout: 120

scenarios:
  - name: "sumPrime load test"
    flow:
      - post:
          url: "/sumPrime"
          json:
            a: "{{ a }}"
            b: "{{ b }}"